intro.org
#+TITLE:     Introducción a R
#+AUTHOR:    Oscar Perpiñán Lamigueiro
#+EMAIL:     oscar.perpinan@gmail.com
#+DATE:      24 de Enero de 2013
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  es
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+BEAMER_FRAME_LEVEL: 3
#+LATEX_HEADER: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Contenidos}\tableofcontents[currentsection]\end{frame}}
#+LATEX_HEADER: \lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
#+LATEX_HEADER: \usepackage{mathpazo}
#+LATEX_HEADER: \setbeamercovered{transparent}
#+LATEX_HEADER: \usefonttheme{serif} 
#+LATEX_HEADER: \usetheme{Goettingen}
#+PROPERTY:  tangle yes
#+PROPERTY:  comments org


* Vectores

** Vectores numéricos

*** Primeros pasos
#+begin_src R 
x <- 1
x
length(x)
class(x)

x <- c(1, 2, 3)
x
length(x)
class(x)
#+end_src

*** Primeras funciones
#+begin_src R 
class(c)
class(length)
length
#+end_src

*** Operaciones sencillas con vectores
#+begin_src R 
  x + 1
  y <- 1:10
  x + y
  x * y
  x^2
#+end_src

*** Generar vectores con =seq=
#+begin_src R 
x1 <- seq(1, 100, by=2)
x1
help(seq)

seq(1, 100, 10)
seq(1, 100, length=10)
seq(1, 1, 10)

x <- seq(1, 100, length=10)
x
length(x)

x <- seq(1, 100, length=10)
y <- seq(2, 100, length=50)
#+end_src

*** Unir vectores con =c=
#+begin_src R 
z <- c(x, y)
z
z + c(1, 2)
z + c(1, 2, 3, 4, 5, 6, 7)
z <- c(z, z, z, z)
z
#+end_src

*** Generar vectores con =rep=
#+begin_src R 
rep(1:10, 4)

length(z)

rep(c(1, 2, 3), 10)
rep(c(1, 2, 3), each=10)
help(rep)
#+end_src


*** Indexado numérico de vectores

#+begin_src R 
  x <- seq(1, 100, 2)
  1:5
  x[c(1, 2, 3, 4, 5)]
  x[1:5]
  x[10:5]
#+end_src

*** Indexado de vectores con condiciones lógicas
#+begin_src R 
  condicion <- (x>30)
  condicion
  class(condicion)
#+end_src

*** Indexado de vectores con condiciones lógicas

#+begin_src R 
  x==37
  x[x==37]
  x[x!=9]
  x[x>20]
#+end_src

**** Y aquí, ¿qué ocurre?					    :B_block:
     :PROPERTIES:
     :BEAMER_env: block
     :END:

#+begin_src R 
x[x=10]
#+end_src

*** Indexado de vectores con =%in%=
#+begin_src R 
y <- seq(101, 200, 2)
y %in% c(101, 127, 141)
y
y[y %in% c(101, 127, 141)]
#+end_src

*** Indexado de vectores con condiciones múltiples

#+begin_src R 
z <- c(x, y)
z
z>150
z[z>150]
z[z<30 | z>150]
z[z>=30 & z<=150]
z[c(1, 10, 40, 80)]
#+end_src

*** Indexado de vectores con condiciones múltiples
#+begin_src R 
cond  <-  (x>10) & (x<50)
cond
cond  <-  (x>=10) & (x<=50)
cond
x[cond]

#+end_src

*** Con las condiciones se pueden hacer operaciones
#+begin_src R 
sum(cond)
!cond
sum(!cond)
length(x[cond])
length(x[!cond])
as.numeric(cond)
#+end_src


** Operaciones con vectores numéricos
*** Aritmética sencilla
#+begin_src R 
x + y
x - y
x * y
x^2 + y^3
exp(x)
log(x)
#+end_src

*** Funciones predefinidas
#+begin_src R 
summary(x)
mean(x)
sd(x)
median(x)
max(x)
min(x)
range(x)
quantile(x)
#+end_src

*** Funciones y condiciones
#+begin_src R 
sum(x)
sum(x[cond])
sum(x[(x>=10) & (x<=50)])
x[1] + x[2] + x[3] + x[4] + x[5]
sum(x[1:5])
#+end_src


*** ¿Y qué hago cuando necesito ayuda?

#+begin_src R 
help(exp)
help(sum)
help(quantile)
#+end_src


** Valores ausentes
   
