intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<title>Introducción a R</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Introducción a R"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-24 jue"/>
<meta name="author" content="Oscar Perpiñán Lamigueiro"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Introducción a R</h1>


<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Vectores</a>
<ul>
<li><a href="#sec-1-1">1.1 Vectores numéricos</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Primeros pasos</a></li>
<li><a href="#sec-1-1-2">1.1.2 Primeras funciones</a></li>
<li><a href="#sec-1-1-3">1.1.3 Operaciones sencillas con vectores</a></li>
<li><a href="#sec-1-1-4">1.1.4 Generar vectores con <code>seq</code></a></li>
<li><a href="#sec-1-1-5">1.1.5 Unir vectores con <code>c</code></a></li>
<li><a href="#sec-1-1-6">1.1.6 Generar vectores con <code>rep</code></a></li>
<li><a href="#sec-1-1-7">1.1.7 Indexado numérico de vectores</a></li>
<li><a href="#sec-1-1-8">1.1.8 Indexado de vectores con condiciones lógicas</a></li>
<li><a href="#sec-1-1-9">1.1.9 Indexado de vectores con condiciones lógicas</a></li>
<li><a href="#sec-1-1-10">1.1.10 Indexado de vectores con <code>%in%</code></a></li>
<li><a href="#sec-1-1-11">1.1.11 Indexado de vectores con condiciones múltiples</a></li>
<li><a href="#sec-1-1-12">1.1.12 Indexado de vectores con condiciones múltiples</a></li>
<li><a href="#sec-1-1-13">1.1.13 Con las condiciones se pueden hacer operaciones</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Operaciones con vectores numéricos</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Aritmética sencilla</a></li>
<li><a href="#sec-1-2-2">1.2.2 Funciones predefinidas</a></li>
<li><a href="#sec-1-2-3">1.2.3 Funciones y condiciones</a></li>
<li><a href="#sec-1-2-4">1.2.4 ¿Y qué hago cuando necesito ayuda?</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Valores ausentes: <code>NA</code></a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 ¿Qué es <code>NA</code>?</a></li>
<li><a href="#sec-1-3-2">1.3.2 <code>NA</code> en las funciones</a></li>
<li><a href="#sec-1-3-3">1.3.3 <code>NA</code> en las funciones</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Matrices</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-1">2.1 Construir una matriz</a></li>
<li><a href="#sec-2-2">2.2 Matrices a partir de vectores: <code>rbind</code> y <code>cbind</code></a></li>
<li><a href="#sec-2-3">2.3 Transponer una matriz</a></li>
<li><a href="#sec-2-4">2.4 Operaciones con matrices</a></li>
<li><a href="#sec-2-5">2.5 Operaciones con matrices: funciones predefinidas</a></li>
<li><a href="#sec-2-6">2.6 La función <code>apply</code></a></li>
<li><a href="#sec-2-7">2.7 Indexado de matrices</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Funciones</a>
<ul>
<li>
<ul>
<li><a href="#sec-3-1">3.1 Todo en R es un objeto</a></li>
<li><a href="#sec-3-2">3.2 Para definir una función usamos la función <code>function</code></a></li>
<li><a href="#sec-3-3">3.3 Definir una función a partir de funciones</a></li>
<li><a href="#sec-3-4">3.4 Y ahora usamos la función con vectores</a></li>
<li><a href="#sec-3-5">3.5 Y también funciona con matrices</a></li>
<li><a href="#sec-3-6">3.6 La función <code>outer</code></a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Listas y <code>data.frame</code></a>
<ul>
<li>
<ul>
<li><a href="#sec-4-1">4.1 Para crear una lista usamos la función <code>list</code></a></li>
<li><a href="#sec-4-2">4.2 Podemos acceder a los elementos por su nombre</a></li>
<li><a href="#sec-4-3">4.3 o por su índice</a></li>
<li><a href="#sec-4-4">4.4 Cada elemento es de una clase diferente</a></li>
<li><a href="#sec-4-5">4.5 y de una longitud diferente</a></li>
<li><a href="#sec-4-6">4.6 Para matrices <code>apply</code>, para listas <code>lapply</code> y <code>sapply</code></a></li>
<li><a href="#sec-4-7">4.7 Para crear un <code>data.frame</code>&hellip;</a></li>
<li><a href="#sec-4-8">4.8 Podemos acceder a los elementos por su nombre</a></li>
<li><a href="#sec-4-9">4.9 o por su índice</a></li>
<li><a href="#sec-4-10">4.10 La función <code>expand.grid</code></a></li>
<li><a href="#sec-4-11">4.11 Funciones sobre <code>data.frame</code></a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Gráficos</a>
<ul>
<li>
<ul>
<li><a href="#sec-5-1">5.1 Base</a></li>
<li><a href="#sec-5-2">5.2 Lattice: <code>xyplot</code></a></li>
<li><a href="#sec-5-3">5.3 Lattice: <code>levelplot</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Vectores</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Vectores numéricos</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Primeros pasos</h4>
<div class="outline-text-4" id="text-1-1-1">




<pre class="src src-R">x <span class="org-constant">&lt;-</span> 1
x
length(x)
class(x)

x <span class="org-constant">&lt;-</span> c(1, 2, 3)
x
length(x)
class(x)
</pre>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Primeras funciones</h4>
<div class="outline-text-4" id="text-1-1-2">




<pre class="src src-R">class(c)
class(length)
length
</pre>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Operaciones sencillas con vectores</h4>
<div class="outline-text-4" id="text-1-1-3">




<pre class="src src-R">x + 1
y <span class="org-constant">&lt;-</span> 1:10
x + y
x * y
x^2
</pre>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Generar vectores con <code>seq</code></h4>
<div class="outline-text-4" id="text-1-1-4">




<pre class="src src-R">x1 <span class="org-constant">&lt;-</span> seq(1, 100, by=2)
x1
help(seq)

seq(1, 100, 10)
seq(1, 100, length=10)
seq(1, 1, 10)

x <span class="org-constant">&lt;-</span> seq(1, 100, length=10)
x
length(x)

x <span class="org-constant">&lt;-</span> seq(1, 100, length=10)
y <span class="org-constant">&lt;-</span> seq(2, 100, length=50)
</pre>


</div>

</div>

<div id="outline-container-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Unir vectores con <code>c</code></h4>
<div class="outline-text-4" id="text-1-1-5">




<pre class="src src-R">z <span class="org-constant">&lt;-</span> c(x, y)
z
z + c(1, 2)
z + c(1, 2, 3, 4, 5, 6, 7)
z <span class="org-constant">&lt;-</span> c(z, z, z, z)
z
</pre>


</div>

</div>

<div id="outline-container-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> Generar vectores con <code>rep</code></h4>
<div class="outline-text-4" id="text-1-1-6">




<pre class="src src-R">rep(1:10, 4)

length(z)

rep(c(1, 2, 3), 10)
rep(c(1, 2, 3), each=10)
help(rep)
</pre>



</div>

</div>

<div id="outline-container-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> Indexado numérico de vectores</h4>
<div class="outline-text-4" id="text-1-1-7">





<pre class="src src-R">x <span class="org-constant">&lt;-</span> seq(1, 100, 2)
1:5
x[c(1, 2, 3, 4, 5)]
x[1:5]
x[10:5]
</pre>


</div>

</div>

<div id="outline-container-1-1-8" class="outline-4">
<h4 id="sec-1-1-8"><span class="section-number-4">1.1.8</span> Indexado de vectores con condiciones lógicas</h4>
<div class="outline-text-4" id="text-1-1-8">




<pre class="src src-R">condicion <span class="org-constant">&lt;-</span> (x&gt;30)
condicion
class(condicion)
</pre>


</div>

</div>

<div id="outline-container-1-1-9" class="outline-4">
<h4 id="sec-1-1-9"><span class="section-number-4">1.1.9</span> Indexado de vectores con condiciones lógicas</h4>
<div class="outline-text-4" id="text-1-1-9">





<pre class="src src-R">x==37
x[x==37]
x[x!=9]
x[x&gt;20]
</pre>


<p>
Y aquí, ¿qué ocurre?
</p>



<pre class="src src-R">x[x=10]
</pre>


</div>

</div>

<div id="outline-container-1-1-10" class="outline-4">
<h4 id="sec-1-1-10"><span class="section-number-4">1.1.10</span> Indexado de vectores con <code>%in%</code></h4>
<div class="outline-text-4" id="text-1-1-10">




<pre class="src src-R">y <span class="org-constant">&lt;-</span> seq(101, 200, 2)
y %<span class="org-keyword">in</span>% c(101, 127, 141)
y
y[y %<span class="org-keyword">in</span>% c(101, 127, 141)]
</pre>


</div>

</div>

<div id="outline-container-1-1-11" class="outline-4">
<h4 id="sec-1-1-11"><span class="section-number-4">1.1.11</span> Indexado de vectores con condiciones múltiples</h4>
<div class="outline-text-4" id="text-1-1-11">





<pre class="src src-R">z <span class="org-constant">&lt;-</span> c(x, y)
z
z&gt;150
z[z&gt;150]
z[z&lt;30 | z&gt;150]
z[z&gt;=30 &amp; z&lt;=150]
z[c(1, 10, 40, 80)]
</pre>


</div>

</div>

<div id="outline-container-1-1-12" class="outline-4">
<h4 id="sec-1-1-12"><span class="section-number-4">1.1.12</span> Indexado de vectores con condiciones múltiples</h4>
<div class="outline-text-4" id="text-1-1-12">




<pre class="src src-R">cond  <span class="org-constant">&lt;-</span>  (x&gt;10) &amp; (x&lt;50)
cond
cond  <span class="org-constant">&lt;-</span>  (x&gt;=10) &amp; (x&lt;=50)
cond
x[cond]

</pre>


</div>

</div>

<div id="outline-container-1-1-13" class="outline-4">
<h4 id="sec-1-1-13"><span class="section-number-4">1.1.13</span> Con las condiciones se pueden hacer operaciones</h4>
<div class="outline-text-4" id="text-1-1-13">




<pre class="src src-R">sum(cond)
!cond
sum(!cond)
length(x[cond])
length(x[!cond])
as.numeric(cond)
</pre>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Operaciones con vectores numéricos</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Aritmética sencilla</h4>
<div class="outline-text-4" id="text-1-2-1">




<pre class="src src-R">x + y
x - y
x * y
x^2 + y^3
exp(x)
log(x)
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Funciones predefinidas</h4>
<div class="outline-text-4" id="text-1-2-2">




<pre class="src src-R">summary(x)
mean(x)
sd(x)
median(x)
max(x)
min(x)
range(x)
quantile(x)
</pre>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Funciones y condiciones</h4>
<div class="outline-text-4" id="text-1-2-3">




<pre class="src src-R">sum(x)
sum(x[cond])
sum(x[(x&gt;=10) &amp; (x&lt;=50)])
x[1] + x[2] + x[3] + x[4] + x[5]
sum(x[1:5])
</pre>



</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> ¿Y qué hago cuando necesito ayuda?</h4>
<div class="outline-text-4" id="text-1-2-4">





<pre class="src src-R">help(exp)
help(sum)
help(quantile)
</pre>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Valores ausentes: <code>NA</code></h3>
<div class="outline-text-3" id="text-1-3">



</div>
