intro.org
*** ¿Qué es =NA=?
#+begin_src R 
class(NA)
seq_along(x)
idx <- sample(seq_along(x), 10)
idx
x[idx]
x2 <- x
x2[idx] <- NA
x2
#+end_src

*** =NA= en las funciones

#+begin_src R 
summary(x2)
mean(x2)
sum(x2)
#+end_src

*** =NA= en las funciones

#+begin_src R 
mean(x2, na.rm=TRUE)
sum(x2, na.rm=TRUE)
sd(x2, na.rm=TRUE)
class(TRUE)
#+end_src


* Matrices
** Construcción de matrices
*** Construir una matriz
#+begin_src R 
z <- 1:12
M  <-  matrix(z, nrow=3)
M
z
help(matrix)
class(M)
dim(M)
summary(M)
#+end_src

*** Matrices a partir de vectores: =rbind= y =cbind=
#+begin_src R 
x <- 1:10
y <- 1:10
z <- 1:10
z <- y <- x <- 1:10

M <- cbind(x, y, z)
M
M <- rbind(x, y, z)
M

rbind(M, M)
cbind(M, M)
#+end_src

*** Transponer una matriz

#+begin_src R 
t(M)
class(t)
dim(t(M))
#+end_src


** Operaciones con matrices
*** Operaciones con matrices

#+begin_src R 
M * M
M ^ 2
M %*% M
M %*% t(M)
help('%*%')
#+end_src

*** Operaciones con matrices: funciones predefinidas

#+begin_src R 
sum(M)
rowSums(M)
colSums(M)
rowMeans(M)
colMeans(M)
#+end_src

*** La función =apply=
#+begin_src R 
help(apply)
apply(M, 1, sum)
apply(M, 2, sum)
apply(M, 1, mean)
apply(M, 2, mean)
apply(M, 1, sd, na.rm=TRUE)
apply(M, 2, sd)
#+end_src


** Indexado de matrices
*** Indexado de matrices
#+begin_src R 
M
M[]
M[1, ]
M[, 1]
sum(M[, 1])
M[1:2, ]
M[1:2, 2:3]
M[1, c(1, 4)]
M[-1,]
M[-c(1, 2),]
#+end_src
    

* Funciones

** Definición de funciones
*** Para definir una función usamos la función =function=
#+begin_src R 
  myFun <- function(x, y) x + y
  myFun(3, 4)
  class(myFun)
#+end_src

*** Definir una función a partir de funciones
#+begin_src R 
foo  <-  function(x, ...){
  mx <- mean(x, ...)
  medx <- median(x, ...)
  sdx <- sd(x, ...)
  c(mx, medx, sdx)
  }
#+end_src
O en forma resumida:
#+begin_src R 
foo <- function(x, ...){c(mean(x, ...), median(x, ...), sd(x, ...))}
#+end_src


** Uso de funciones
*** Y ahora usamos la función con vectores
#+begin_src R 
foo(1:10)

rnorm(100)
help(rnorm)
foo(rnorm(1e5))
#+end_src

*** Y también funciona con matrices
#+begin_src R 
rowMeans(M)
apply(M, 1, foo)
colMeans(M)
apply(M, 2, foo)
#+end_src

*** La función =outer=
#+begin_src R 
f <- function(x, y)x^2+y^2
f
f(1, 2)
x
y

z <- outer(x, y, f)
z
image(x, y, z)
#+end_src


* Listas y data.frame

** Listas
*** Para crear una lista usamos la función =list=
#+begin_src R 
  lista <- list(a=c(1,3,5),
                b=c('l', 'p', 'r', 's'),
                c=3)
  class(list)
  class(lista)
#+end_src

*** Podemos acceder a los elementos por su nombre
#+begin_src R 
lista
lista$a
lista$b
lista$c
#+end_src

*** o por su índice
#+begin_src R 
  lista[1]
  lista[[1]]
  
  class(lista[1])
  class(lista[[1]])
  
  lista[2]
  lista[[2]]
  
  class(lista[2])
  class(lista[[2]])
#+end_src

*** Cada elemento es de una clase diferente
#+begin_src R 
class(lista)
class(lista$a)
class(lista$b)
class(lista$c)
#+end_src
*** y de una longitud diferente
#+begin_src R 
length(lista)
length(lista$a)
length(lista$b)
length(lista$c)
#+end_src

*** Para matrices =apply=, para listas =lapply= y =sapply=
#+begin_src R 
lapply(lista, length)
sapply(lista, length)

lista <- list(x = 1:10,
              y = seq(0, 10, 2),
              z = rnorm(30))
lista
lapply(lista, sum)
lapply(lista, median)
lapply(lista, foo)
#+end_src


** Data.frame
*** Para crear un =data.frame=...
#+begin_src R 
df <- data.frame(x = 1:10,
                 y = rnorm(10),
                 z = 0)

length(df)
dim(df)
#+end_src
*** Podemos acceder a los elementos por su nombre
#+begin_src R 
df$x
df$y
df$z
#+end_src

*** o por su índice
#+begin_src R 
df
df[1,]
df[,1]
df[,2]
#+end_src

*** La función =expand.grid=

#+begin_src R 
x <- y <- seq(-4*pi, 4*pi, len=200)
df <- expand.grid(x = x, y = y)
head(df)
tail(df)
summary(df)
dim(df)
names(df)
#+end_src

*** Funciones sobre =data.frame=

#+begin_src R 
circles <- function(object){
  r <- with(object, sqrt(x^2 + y^2))
  res <- cos(r^2)*exp(-r/6)
  res}

df$result <- circles(df)
head(df)
#+end_src


* Gráficos
** Base
*** Base
#+begin_src R 
plot(df$x, df$y)
#+end_src
** Grid
