intro.html

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> ¿Qué es <code>NA</code>?</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-R">class(<span class="org-type">NA</span>)
seq_along(x)
idx <span class="org-constant">&lt;-</span> sample(seq_along(x), 10)
idx
x[idx]
x2 <span class="org-constant">&lt;-</span> x
x2[idx] <span class="org-constant">&lt;-</span> <span class="org-type">NA</span>
x2
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> <code>NA</code> en las funciones</h4>
<div class="outline-text-4" id="text-1-3-2">





<pre class="src src-R">summary(x2)
mean(x2)
sum(x2)
</pre>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> <code>NA</code> en las funciones</h4>
<div class="outline-text-4" id="text-1-3-3">





<pre class="src src-R">mean(x2, na.rm=<span class="org-type">TRUE</span>)
sum(x2, na.rm=<span class="org-type">TRUE</span>)
sd(x2, na.rm=<span class="org-type">TRUE</span>)
class(<span class="org-type">TRUE</span>)
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Matrices</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-4">
<h4 id="sec-2-1"><span class="section-number-4">2.1</span> Construir una matriz</h4>
<div class="outline-text-4" id="text-2-1">




<pre class="src src-R">z <span class="org-constant">&lt;-</span> 1:12
M  <span class="org-constant">&lt;-</span>  matrix(z, nrow=3)
M
z
help(matrix)
class(M)
dim(M)
summary(M)
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-4">
<h4 id="sec-2-2"><span class="section-number-4">2.2</span> Matrices a partir de vectores: <code>rbind</code> y <code>cbind</code></h4>
<div class="outline-text-4" id="text-2-2">




<pre class="src src-R">x <span class="org-constant">&lt;-</span> 1:10
y <span class="org-constant">&lt;-</span> 1:10
z <span class="org-constant">&lt;-</span> 1:10
z <span class="org-constant">&lt;-</span> y <span class="org-constant">&lt;-</span> x <span class="org-constant">&lt;-</span> 1:10

M <span class="org-constant">&lt;-</span> cbind(x, y, z)
M
M <span class="org-constant">&lt;-</span> rbind(x, y, z)
M

rbind(M, M)
cbind(M, M)
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-4">
<h4 id="sec-2-3"><span class="section-number-4">2.3</span> Transponer una matriz</h4>
<div class="outline-text-4" id="text-2-3">





<pre class="src src-R">t(M)
class(t)
dim(t(M))
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-4">
<h4 id="sec-2-4"><span class="section-number-4">2.4</span> Operaciones con matrices</h4>
<div class="outline-text-4" id="text-2-4">





<pre class="src src-R">M * M
M ^ 2
M %*% M
M %*% t(M)
help(<span class="org-string">'%*%'</span>)
</pre>


</div>

</div>

<div id="outline-container-2-5" class="outline-4">
<h4 id="sec-2-5"><span class="section-number-4">2.5</span> Operaciones con matrices: funciones predefinidas</h4>
<div class="outline-text-4" id="text-2-5">





<pre class="src src-R">sum(M)
rowSums(M)
colSums(M)
rowMeans(M)
colMeans(M)
</pre>


</div>

</div>

<div id="outline-container-2-6" class="outline-4">
<h4 id="sec-2-6"><span class="section-number-4">2.6</span> La función <code>apply</code></h4>
<div class="outline-text-4" id="text-2-6">




<pre class="src src-R">help(apply)
apply(M, 1, sum)
apply(M, 2, sum)
apply(M, 1, mean)
apply(M, 2, mean)
apply(M, 1, sd, na.rm=<span class="org-type">TRUE</span>)
apply(M, 2, sd)
</pre>


</div>

</div>

<div id="outline-container-2-7" class="outline-4">
<h4 id="sec-2-7"><span class="section-number-4">2.7</span> Indexado de matrices</h4>
<div class="outline-text-4" id="text-2-7">




<pre class="src src-R">M
M[]
M[1, ]
M[, 1]
sum(M[, 1])
M[1:2, ]
M[1:2, 2:3]
M[1, c(1, 4)]
M[-1,]
M[-c(1, 2),]
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Funciones</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-4">
<h4 id="sec-3-1"><span class="section-number-4">3.1</span> Todo en R es un objeto</h4>
<div class="outline-text-4" id="text-3-1">





<pre class="src src-R">class(sum)
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-4">
<h4 id="sec-3-2"><span class="section-number-4">3.2</span> Para definir una función usamos la función <code>function</code></h4>
<div class="outline-text-4" id="text-3-2">




<pre class="src src-R"><span class="org-function-name">myFun</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(x, y) x + y
myFun(3, 4)
class(myFun)
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-4">
<h4 id="sec-3-3"><span class="section-number-4">3.3</span> Definir una función a partir de funciones</h4>
<div class="outline-text-4" id="text-3-3">




<pre class="src src-R"><span class="org-function-name">foo</span>  <span class="org-constant">&lt;-</span>  <span class="org-keyword">function</span>(x, ...){
  mx <span class="org-constant">&lt;-</span> mean(x, ...)
  medx <span class="org-constant">&lt;-</span> median(x, ...)
  sdx <span class="org-constant">&lt;-</span> sd(x, ...)
  c(mx, medx, sdx)
  }
</pre>

<p>
O en forma resumida:
</p>


<pre class="src src-R"><span class="org-function-name">foo</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(x, ...){c(mean(x, ...), median(x, ...), sd(x, ...))}
</pre>


</div>

</div>

<div id="outline-container-3-4" class="outline-4">
<h4 id="sec-3-4"><span class="section-number-4">3.4</span> Y ahora usamos la función con vectores</h4>
<div class="outline-text-4" id="text-3-4">




<pre class="src src-R">foo(1:10)

rnorm(100)
help(rnorm)
foo(rnorm(1e5))
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-4">
<h4 id="sec-3-5"><span class="section-number-4">3.5</span> Y también funciona con matrices</h4>
<div class="outline-text-4" id="text-3-5">




<pre class="src src-R">rowMeans(M)
apply(M, 1, foo)
colMeans(M)
apply(M, 2, foo)
</pre>


</div>

</div>

<div id="outline-container-3-6" class="outline-4">
<h4 id="sec-3-6"><span class="section-number-4">3.6</span> La función <code>outer</code></h4>
<div class="outline-text-4" id="text-3-6">




<pre class="src src-R"><span class="org-function-name">f</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(x, y)x^2+y^2
f
f(1, 2)
x
y

z <span class="org-constant">&lt;-</span> outer(x, y, f)
z
image(x, y, z)
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Listas y <code>data.frame</code></h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-4">
<h4 id="sec-4-1"><span class="section-number-4">4.1</span> Para crear una lista usamos la función <code>list</code></h4>
<div class="outline-text-4" id="text-4-1">




<pre class="src src-R">lista <span class="org-constant">&lt;-</span> list(a=c(1,3,5),
              b=c(<span class="org-string">'l'</span>, <span class="org-string">'p'</span>, <span class="org-string">'r'</span>, <span class="org-string">'s'</span>),
              c=3)
class(list)
class(lista)
</pre>


</div>

</div>

<div id="outline-container-4-2" class="outline-4">
<h4 id="sec-4-2"><span class="section-number-4">4.2</span> Podemos acceder a los elementos por su nombre</h4>
<div class="outline-text-4" id="text-4-2">




<pre class="src src-R">lista
lista$a
lista$b
lista$c
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-4">
<h4 id="sec-4-3"><span class="section-number-4">4.3</span> o por su índice</h4>
<div class="outline-text-4" id="text-4-3">




<pre class="src src-R">lista[1]
lista[[1]]

class(lista[1])
class(lista[[1]])

lista[2]
lista[[2]]

class(lista[2])
class(lista[[2]])
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-4">
<h4 id="sec-4-4"><span class="section-number-4">4.4</span> Cada elemento es de una clase diferente</h4>
<div class="outline-text-4" id="text-4-4">




<pre class="src src-R">class(lista)
class(lista$a)
class(lista$b)
class(lista$c)
</pre>

</div>

</div>

<div id="outline-container-4-5" class="outline-4">
<h4 id="sec-4-5"><span class="section-number-4">4.5</span> y de una longitud diferente</h4>
<div class="outline-text-4" id="text-4-5">




<pre class="src src-R">length(lista)
length(lista$a)
length(lista$b)
length(lista$c)
</pre>


</div>

</div>

<div id="outline-container-4-6" class="outline-4">
<h4 id="sec-4-6"><span class="section-number-4">4.6</span> Para matrices <code>apply</code>, para listas <code>lapply</code> y <code>sapply</code></h4>
<div class="outline-text-4" id="text-4-6">




<pre class="src src-R">lapply(lista, length)
sapply(lista, length)

lista <span class="org-constant">&lt;-</span> list(x = 1:10,
              y = seq(0, 10, 2),
              z = rnorm(30))
lista
lapply(lista, sum)
lapply(lista, median)
lapply(lista, foo)
</pre>


</div>

</div>

<div id="outline-container-4-7" class="outline-4">
<h4 id="sec-4-7"><span class="section-number-4">4.7</span> Para crear un <code>data.frame</code>&hellip;</h4>
<div class="outline-text-4" id="text-4-7">




<pre class="src src-R">df <span class="org-constant">&lt;-</span> data.frame(x = 1:10,
                 y = rnorm(10),
                 z = 0)

length(df)
dim(df)
</pre>

</div>

</div>

<div id="outline-container-4-8" class="outline-4">
<h4 id="sec-4-8"><span class="section-number-4">4.8</span> Podemos acceder a los elementos por su nombre</h4>
<div class="outline-text-4" id="text-4-8">




<pre class="src src-R">df$x
df$y
df$z
</pre>


</div>

</div>

<div id="outline-container-4-9" class="outline-4">
<h4 id="sec-4-9"><span class="section-number-4">4.9</span> o por su índice</h4>
<div class="outline-text-4" id="text-4-9">




<pre class="src src-R">df
df[1,]
df[,1]
df[,2]
</pre>


</div>

</div>

<div id="outline-container-4-10" class="outline-4">
<h4 id="sec-4-10"><span class="section-number-4">4.10</span> La función <code>expand.grid</code></h4>
<div class="outline-text-4" id="text-4-10">





<pre class="src src-R">x <span class="org-constant">&lt;-</span> y <span class="org-constant">&lt;-</span> seq(-4*pi, 4*pi, len=200)
df <span class="org-constant">&lt;-</span> expand.grid(x = x, y = y)
head(df)
tail(df)
summary(df)
dim(df)
names(df)
</pre>


</div>

</div>

<div id="outline-container-4-11" class="outline-4">
<h4 id="sec-4-11"><span class="section-number-4">4.11</span> Funciones sobre <code>data.frame</code></h4>
<div class="outline-text-4" id="text-4-11">





<pre class="src src-R"><span class="org-function-name">circles</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(object){
  r <span class="org-constant">&lt;-</span> with(object, sqrt(x^2 + y^2))
  res <span class="org-constant">&lt;-</span> cos(r^2)*exp(-r/6)
  res}

df$result <span class="org-constant">&lt;-</span> circles(df)
head(df)
</pre>


</div>
</div>

</div>
